spec/cassettes/Create_payment_on_successful_charge/creates_a_payment_with_the_amount.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15KZdqJwPS7CsuHva6Aqr3QX
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.1
      Authorization:
      - Bearer sk_test_B2910d2ZEeOwXAC6NbJhSbfr
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.1","lang":"ruby","lang_version":"2.1.5 p273 (2014-11-13)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        tealeaf1-154988 3.13.4 #1 SMP Mon Mar 3 09:07:22 UTC 2014 x86_64 x86_64 x86_64
        GNU/Linux"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 13 Jan 2015 21:59:30 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1839'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8VdrMZghoVNylkOx
      Stripe-Version:
      - '2014-12-22'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15KZdqJwPS7CsuHva6Aqr3QX",
          "created": 1421174630,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_15KZdqJwPS7CsuHvw8lj228G",
              "object": "charge",
              "created": 1421174630,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "captured": true,
              "card": {
                "id": "card_15KZdpJwPS7CsuHvVuCSoOc1",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2015,
                "fingerprint": "rLAb2nRO0fHnP9cK",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "customer": "cus_5VapeF51RrbKU3"
              },
              "balance_transaction": "txn_15KZdqJwPS7CsuHvJ9IzERK4",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_5VapeF51RrbKU3",
              "invoice": "in_15KZdqJwPS7CsuHvYv5tDthz",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_descriptor": "vpass charge",
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_15KZdqJwPS7CsuHvw8lj228G/refunds",
                "data": []
              }
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_5Vap998eka1gQD",
          "api_version": "2014-12-22"
        }
    http_version: 
  recorded_at: Tue, 13 Jan 2015 21:59:30 GMT
recorded_with: VCR 2.9.3
